In [1]:
%load_ext sql
%sql mysql://root:root@localhost/testing_system_db

# Question 1. Tạo Trigger không cho phép User nhập vào Group có Ngày tạo trước 1 năm trước

In [26]:
%%sql
DROP    TRIGGER IF EXISTS   trg_BeforeInserGroup;
CREATE  TRIGGER             trg_BeforeInserGroup
BEFORE INSERT ON `Group`
FOR EACH ROW
BEGIN
    DECLARE v_one_year_ago DATETIME;
    SET     v_one_year_ago = DATE_SUB(NOW(), INTERVAL 1 YEAR);

    IF NEW.CreateDate < v_one_year_ago THEN
        SIGNAL SQLSTATE '45001'
        SET MESSAGE_TEXT = 'CreateDate cannot be earlier than one year ago';
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [28]:
%%sql
INSERT INTO `Group` (GroupName  , CreatorID , CreateDate    )
VALUES              ('New_Group', 3         , '2023-05-01'  );

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.OperationalError) (1644, 'CreateDate cannot be earlier than one year ago')
[SQL: INSERT INTO `Group`  (GroupName  , CreatorID , CreateDate    )
VALUES              ('New_Group', 3         , '2023-05-01'  );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Question 2. Tạo Trigger không cho phép User thêm bất kỳ User nào vào Phòng "Human Resource" nữa, khi thêm thì hiện ra thông báo "Department "Human Resource" cannot add more user"

In [16]:
%%sql
SELECT  *
FROM    `Department`
WHERE   DepartmentName = "Human Resources";

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(3, 'Human Resources')]

In [23]:
%%sql
SELECT  *
FROM    `Account`
LIMIT   0;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [20]:
%%sql
DROP    TRIGGER IF EXISTS   trg_BeforeInsertUser;
CREATE  TRIGGER             trg_BeforeInsertUser
BEFORE INSERT ON `Account`
FOR EACH ROW
BEGIN
    IF NEW.DepartmentID =   (SELECT DepartmentID
                            FROM    `Department`
                            WHERE   DepartmentName = 'Human Resources'
                            ) THEN
        SIGNAL SQLSTATE  '45002'
        SET MESSAGE_TEXT = 'Department "Human Resources" cannot add more user';
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [21]:
%%sql
INSERT INTO `Account`   (UserName, DepartmentID)
VALUES                  ('Wang Hy', 3);

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.OperationalError) (1644, 'Department "Human Resources" cannot add more user')
[SQL: INSERT INTO `Account` (UserName, DepartmentID)
VALUES ('Wang Hy', 3);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Question 3. Cấu hình 1 Group có nhiều nhất là 5 User

In [27]:
%%sql
SELECT      g.GroupID, g.GroupName, COUNT(ga.AccountID)
FROM        `Group`         AS g
LEFT JOIN   `GroupAccount`  AS ga   ON  ga.GroupID = g.GroupID
GROUP BY    g.GroupID;

 * mysql://root:***@localhost/testing_system_db
9 rows affected.

[(1, 'Management Team', 5),
 (2, 'HR Support', 15),
 (3, 'ENG Team', 5),
 (4, 'Operations Team', 7),
 (5, 'Marketing Team', 2),
 (6, 'HR Team', 3),
 (7, 'Finance Team', 2),
 (8, 'ENG_Help Team', 6),
 (9, 'Analyst Team', 0)]

In [32]:
%%sql
SELECT  COUNT(*)
FROM    `GroupAccount`
WHERE   GroupID = 8;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(6,)]

In [34]:
%%sql
DROP    TRIGGER IF EXISTS trg_BeforeInsertGroupAccount;
CREATE  TRIGGER           trg_BeforeInsertGroupAccount
BEFORE INSERT ON `GroupAccount`
FOR EACH ROW
BEGIN
    DECLARE user_count INT;
    SET user_count =    (SELECT     COUNT(*)
                        FROM        `GroupAccount`
                        WHERE       GroupID = NEW.GroupID
                        );
    IF user_count > 5 THEN
        SIGNAL SQLSTATE '45003'
        SET MESSAGE_TEXT = 'Cannot add more than 5 User to the Group';
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [37]:
%%sql
INSERT INTO `GroupAccount`  (GroupID, AccountID)
VALUES                      (8      , 4     );

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.OperationalError) (1644, 'Cannot add more than 5 User to the Group')
[SQL: INSERT INTO `GroupAccount`  (GroupID, AccountID)
VALUES                      (8      , 4     );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Question 4. Cấu hình 1 Bài thi có nhiều nhất là 5 Question

In [39]:
%%sql
SELECT      ExamID, COUNT(QuestionID)
FROM        ExamQuestion
GROUP BY    ExamID;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[(1, 4),
 (2, 2),
 (3, 4),
 (4, 2),
 (5, 5),
 (6, 5),
 (7, 2),
 (8, 2),
 (9, 3),
 (10, 2),
 (11, 6)]

In [51]:
%%sql
DROP    TRIGGER IF EXISTS trg_BeforeInsertExamQuestion;
CREATE  TRIGGER           trg_BeforeInsertExamQuestion
BEFORE INSERT ON `ExamQuestion`
FOR EACH ROW
BEGIN
    DECLARE question_count INT;

    SET question_count =    (SELECT COUNT(*)   
                            FROM    `ExamQuestion`
                            WHERE   ExamID = NEW.ExamID
                            );
    
    IF question_count > 5 THEN
        SIGNAL SQLSTATE '45004'
        SET MESSAGE_TEXT = 'Maximum questions per exam exceeded. Limit: 5';
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [52]:
%%sql
INSERT INTO `ExamQuestion`  (ExamID , QuestionID)
VALUES                      (11     , 1         );

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.OperationalError) (1644, 'Maximum questions per exam exceeded. Limit: 5')
[SQL: INSERT INTO `ExamQuestion`  (ExamID , QuestionID)
VALUES                      (11     , 1         );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Question 5. Tạo Trigger không cho User xóa Tài khoản có Email là admin@gmail.com (các Tài khoản khác có thể được xóa và sẽ xóa tất cả các thông tin liên quan)

In [5]:
%%sql
SELECT  *
FROM    `Account`
LIMIT   0;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [19]:
%%sql
SELECT  *
FROM    `Department`;

 * mysql://root:***@localhost/testing_system_db
6 rows affected.

[(1, 'Engineering'),
 (4, 'Finance'),
 (3, 'Human Resources'),
 (2, 'Marketing'),
 (5, 'Operations'),
 (7, 'Phòng chờ')]

In [20]:
%%sql
INSERT INTO `Account` (Email            , Username, FullName, DepartmentID  , PositionID, CreateDate    )
VALUES                ('admin@gmail.com', 'admin' , 'admin' , 7             , 3         , '2024-05-27'  );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [22]:
%%sql
SELECT  *
FROM    `Account`
WHERE   Email = "admin@gmail.com";

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(20, 'admin@gmail.com', 'admin', 'admin', 7, 3, datetime.datetime(2024, 5, 27, 0, 0))]

In [25]:
%%sql
DROP    TRIGGER IF EXISTS   trg_PreventAdminDelete;
CREATE  TRIGGER             trg_PreventAdminDelete
BEFORE DELETE ON `Account`
FOR EACH ROW
BEGIN
    IF OLD.Email = 'admin@gmail.com' THEN
        SIGNAL SQLSTATE '45005'
        SET MESSAGE_TEXT = 'Cannot delete admin account';
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [26]:
%%sql
DELETE
FROM    `Account`
WHERE   Email = 'admin@gmail.com';

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.OperationalError) (1644, 'Cannot delete admin account')
[SQL: DELETE
FROM    `Account`
WHERE   Email = 'admin@gmail.com';]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Question 6. Không dùng cấu hình Default cho Field DepartmentID của bảng Account, hãy tạo Trigger cho phép User khi tạo Account không điền vào DepartmentID thì sẽ được phân vào phòng ban "Phòng chờ"

In [29]:
%%sql
DROP    TRIGGER IF EXISTS   trg_DefaultDepartmentOnInsert;
CREATE  TRIGGER             trg_DefaultDepartmentOnInsert
BEFORE INSERT ON `Account`
FOR EACH ROW
BEGIN
    DECLARE default_deptID INT;

    INSERT INTO `Department` (DepartmentName)
    SELECT      'Phòng chờ'
    WHERE       NOT EXISTS (SELECT  1
                            FROM    `Department`
                            WHERE   DepartmentName = 'Phòng chờ'
                            );

    SELECT  DepartmentID INTO default_deptID
    FROM    `Department`
    WHERE   DepartmentName = 'Phòng chờ'
    LIMIT   1;

    IF NEW.DepartmentID IS NULL THEN
        SET NEW.DepartmentID = default_deptID;
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [32]:
%%sql
INSERT INTO `Account`   (Email              , Username  , Fullname  , PositionID, CreateDate    )
VALUES                  ('user1@example.com', 'user1'   , 'user one', 8         , '2024-05-27'  );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [33]:
%%sql
SELECT  *
FROM    `Account`
WHERE   Email = "user1@example.com";

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(21, 'user1@example.com', 'user1', 'user one', 7, 8, datetime.datetime(2024, 5, 27, 0, 0))]

# Question 7. Cấu hình 1 Bài thi chỉ cho phép User tạo tối đa 4 Answers cho mỗi Question, trong đó có tối đa 2 đáp án đúng

In [124]:
%%sql
SELECT      eq.ExamID, q.QuestionID, a.isCorrect, COUNT(a.AnswerID)
FROM        `ExamQuestion`  AS eq
LEFT JOIN   `Question`      AS q    ON q.QuestionID = eq.QuestionID
LEFT JOIN   `Answer`        AS a    ON a.QuestionID = q.QuestionID
WHERE       eq.ExamID = 1
GROUP By    eq.ExamID, q.QuestionID, a.isCorrect
HAVING      a.isCorrect = 1
ORDER BY    eq.ExamID;

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[(1, 1, b'\x01', 4),
 (1, 2, b'\x01', 2),
 (1, 7, b'\x01', 2),
 (1, 8, b'\x01', 3)]

In [149]:
%%sql
SELECT  COUNT(AnswerID), SUM(isCorrect = TRUE)
FROM    `Answer`
WHERE   QuestionID = 1;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(6, Decimal('4'))]

In [154]:
%%sql
DROP    TRIGGER IF EXISTS   trg_ValidateAnswers;
CREATE  TRIGGER             trg_ValidateAnswers
BEFORE INSERT ON `ExamQuestion`
FOR EACH ROW
BEGIN
    DECLARE answer_count            INT;
    DECLARE correct_answer_count    INT;

    SELECT  COUNT(a.AnswerID)   , SUM(a.isCorrect = TRUE)
    INTO    answer_count        , correct_answer_count
    FROM    `Answer` AS a
    WHERE   a.QuestionID = NEW.QuestionID;

    IF answer_count >= 4 THEN
        SIGNAL SQLSTATE '45007'
        SET MESSAGE_TEXT = 'Each question can have a maximum of 4 answers.';
    END IF;

    IF correct_answer_count >= 2 THEN
        SIGNAL SQLSTATE '45007'
        SET MESSAGE_TEXT = 'Each question can have a maximum of 2 correct answers.';
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [122]:
%%sql
SELECT  *
FROM    `ExamQuestion`
WHERE   ExamID = 1;

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[(1, 1), (1, 2), (1, 7), (1, 8)]

In [117]:
%%sql
SELECT  QuestionID, AnswerID, isCorrect
FROM    `Answer`
WHERE   QuestionID = 1;

 * mysql://root:***@localhost/testing_system_db
6 rows affected.

[(1, 1, b'\x01'),
 (1, 2, b'\x00'),
 (1, 3, b'\x01'),
 (1, 30, b'\x01'),
 (1, 31, b'\x01'),
 (1, 41, b'\x00')]

In [128]:
%%sql
SELECT      eq.ExamID, q.QuestionID, a.isCorrect, a.AnswerID
FROM        `ExamQuestion`  AS eq
LEFT JOIN   `Question`      AS q    ON q.QuestionID = eq.QuestionID
LEFT JOIN   `Answer`        AS a    ON a.QuestionID = q.QuestionID
WHERE       eq.ExamID = 1
AND         q.QuestionID = 1
ORDER BY    a.isCorrect;

 * mysql://root:***@localhost/testing_system_db
6 rows affected.

[(1, 1, b'\x00', 2),
 (1, 1, b'\x00', 41),
 (1, 1, b'\x01', 1),
 (1, 1, b'\x01', 3),
 (1, 1, b'\x01', 30),
 (1, 1, b'\x01', 31)]

In [134]:
%%sql
SELECT      QuestionID, COUNT(AnswerID), SUM(isCorrect = True)
FROM        `Answer`
GROUP BY    QuestionID;

 * mysql://root:***@localhost/testing_system_db
16 rows affected.

[(1, 6, Decimal('4')),
 (2, 2, Decimal('2')),
 (3, 4, Decimal('1')),
 (4, 1, Decimal('1')),
 (5, 4, Decimal('2')),
 (6, 2, Decimal('0')),
 (7, 2, Decimal('2')),
 (8, 5, Decimal('3')),
 (9, 3, Decimal('1')),
 (10, 2, Decimal('2')),
 (11, 2, Decimal('0')),
 (13, 2, Decimal('2')),
 (15, 2, Decimal('1')),
 (16, 1, Decimal('1')),
 (17, 1, Decimal('1')),
 (18, 2, Decimal('2'))]

Thêm vào bài thi ExamID = 1: câu hỏi QuestionID = 8 (có 5 câu trả lời với 3 câu trả lời đúng). Trigger sẽ báo lỗi:

In [155]:
%%sql
INSERT INTO `ExamQuestion`  (ExamID , QuestionID)
VALUES                      (1      , 8         );

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.OperationalError) (1644, 'Each question can have a maximum of 4 answers.')
[SQL: INSERT INTO `ExamQuestion`  (ExamID , QuestionID)
VALUES                      (1      , 8         );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Question 8: Viết Trigger sửa lại dữ liệu cho đúng: Nếu User nhập vào Gender của Account là Nam, Nữ, chưa xác định thì sẽ đổi lại thành M, F, U cho giống với cấu hình ở Database

# Question 9: Viết Trigger không cho phép User xóa Bài thi mới tạo được 2 ngày

In [158]:
%%sql
INSERT INTO `Exam`  (Code       , Title         , CategoryID, Duration  , CreatorID , CreateDate    )
VALUES              ("VTIQ012"  , "Đề thi mới"  , 2         , 60        , 2         , '2024-05-27'  );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [159]:
%%sql
SELECT  *
FROM    `Exam`
WHERE   CreateDate >= NOW() - INTERVAL 2 DAY;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(12, 'VTIQ012', 'Đề thi mới', 2, 60, 2, datetime.datetime(2024, 5, 27, 0, 0))]

In [160]:
%%sql
DROP    TRIGGER IF EXISTS   trg_PreventDeleteRecentExams;
CREATE  TRIGGER             trg_PreventDeleteRecentExams
BEFORE DELETE ON `Exam`
FOR EACH ROW
BEGIN
    IF (OLD.CreateDate >= NOW() - INTERVAL 2 DAY) THEN
        SIGNAL SQLSTATE '45008'
        SET MESSAGE_TEXT = 'Cannot  delete exams within the last 2 days';
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [162]:
%%sql
DELETE
FROM    `Exam`
WHERE   ExamID = 12;

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.OperationalError) (1644, 'Cannot  delete exams within the last 2 days')
[SQL: DELETE
FROM    `Exam`
WHERE   ExamID = 12;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Question 10. Viết Trigger cho phép User chỉ được Update, Delete các Question khi nó chưa nằm trong Exam nào

In [172]:
%%sql
SELECT      q.QuestionID, eq.ExamID
FROM        `Question`      AS q
LEFT JOIN   `ExamQuestion`  AS eq   ON eq.QuestionID = q.QuestionID
WHERE       eq.ExamID IS NULL;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(19, None)]

In [185]:
%%sql
SELECT  COUNT(*)
FROM    `ExamQuestion`
WHERE   QuestionID = 1;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(3,)]

In [192]:
%%sql
DROP    TRIGGER IF EXISTS   trg_RestrictUpdateOnQuestion;
CREATE  TRIGGER             trg_RestrictUpdateOnQuestion
BEFORE UPDATE ON `Question`
FOR EACH ROW
BEGIN
    DECLARE exam_count INT;

    SELECT  COUNT(*) INTO exam_count
    FROM    `ExamQuestion`
    WHERE   QuestionID = OLD.QuestionID;
    
    IF exam_count > 0 THEN
        SIGNAL SQLSTATE '45010'
        SET MESSAGE_TEXT = 'Update not allowed: The question is part of an exam.';
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [193]:
%%sql
DROP    TRIGGER IF EXISTS   trg_RestrictDeleteOnQuestion;
CREATE  TRIGGER             trg_RestrictDeleteOnQuestion
BEFORE DELETE ON `Question`
FOR EACH ROW
BEGIN
    DECLARE exam_count INT;

    SELECT  COUNT(*) INTO exam_count
    FROM    `ExamQuestion`
    WHERE   QuestionID = OLD.QuestionID;
    
    IF exam_count > 0 THEN
        SIGNAL SQLSTATE '45010'
        SET MESSAGE_TEXT = 'Delete not allowed: The question is part of an exam.';
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [194]:
%%sql
UPDATE  `Question`
SET     Content = 'Updated content'
WHERE   QuestionID = 1;

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.OperationalError) (1644, 'Update not allowed: The question is part of an exam.')
[SQL: UPDATE  `Question`
SET     Content = 'Updated content'
WHERE   QuestionID = 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [196]:
%%sql
DELETE
FROM    `Question`
WHERE   QuestionID = 1;

 * mysql://root:***@localhost/testing_system_db
(MySQLdb.OperationalError) (1644, 'Delete not allowed: The question is part of an exam.')
[SQL: DELETE
FROM    `Question`
WHERE   QuestionID = 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Question 11. Lấy ra thông tin Exam: nếu Duration <= 30 thì đổi thành "Short time", nếu 30 < Duration <= 60 thì đổi thành "Medium time", nếu Duration > 60 thì đổi thành "Long time"

In [23]:
%%sql
SELECT  ExamID, Title,
        CASE
            WHEN Duration <= 30 THEN 'Short time'
            WHEN Duration <= 60 THEN 'Medium time'
            ELSE 'Long time'
        END AS Duration
FROM    Exam;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[(1, 'Đề thi An toàn 01', 'Medium time'),
 (2, 'Đề thi Nội quy 01', 'Medium time'),
 (3, 'Đề thi Nội quy 02', 'Long time'),
 (4, 'Đề thi An toàn 02', 'Long time'),
 (5, 'Đề thi định kỳ 01', 'Medium time'),
 (6, 'Đề thi An toàn 03', 'Medium time'),
 (7, 'Đề thi Phân tích 01', 'Long time'),
 (8, 'Đề thi Mục tiêu', 'Medium time'),
 (9, 'Đề thi Sản phẩm', 'Long time'),
 (10, 'Đề thi Phân tích 02', 'Medium time'),
 (11, 'Đề thi định kỳ 02', 'Medium time')]

# Question 12. Thống kê số Account trong mỗi Group và in ra thêm 1 Column nữa có tên là `the_number_user_amount` và mang giá trị được quy định như sau: few (nếu số lượng User trong Group =< 5), normal (nếu số lượng User trong Group <= 20 và > 5), higher (nếu số lượng User trong Group > 20)

In [17]:
%%sql
SELECT      g.GroupName, COUNT(ga.AccountID) AS NUM_ACCOUNT,
            CASE
                WHEN    COUNT(ga.AccountID) <=5    THEN 'few'
                WHEN    COUNT(ga.AccountID) < 15   THEN 'normal'
                ELSE    'higher'
            END AS the_number_user_amount
FROM        GroupAccount    AS ga
RIGHT JOIN  `Group`         AS g    ON g.GroupID = ga.GroupID
GROUP BY    g.GroupName;

 * mysql://root:***@localhost/testing_system_db
9 rows affected.

[('Analyst Team', 0, 'few'),
 ('ENG Team', 5, 'few'),
 ('ENG_Help Team', 6, 'normal'),
 ('Finance Team', 2, 'few'),
 ('HR Support', 15, 'higher'),
 ('HR Team', 3, 'few'),
 ('Management Team', 5, 'few'),
 ('Marketing Team', 2, 'few'),
 ('Operations Team', 7, 'normal')]

# Question 13. Thống kê số Account mỗi Phòng ban (phòng ban không có User thì sẽ thay giá trị 0 thành "Không có User")

In [4]:
%%sql
SELECT  *
FROM    Department;

 * mysql://root:***@localhost/testing_system_db
6 rows affected.

[(1, 'Engineering'),
 (4, 'Finance'),
 (3, 'Human Resources'),
 (2, 'Marketing'),
 (5, 'Operations'),
 (7, 'Phòng chờ')]

In [3]:
%%sql
SELECT      d.DepartmentName, COUNT(a.AccountID)
FROM        Account     AS a
RIGHT JOIN  Department  AS d    ON d.DepartmentID = a.DepartmentID
GROUP BY    d.DepartmentName;

 * mysql://root:***@localhost/testing_system_db
6 rows affected.

[('Engineering', 5),
 ('Finance', 2),
 ('Human Resources', 3),
 ('Marketing', 2),
 ('Operations', 7),
 ('Phòng chờ', 0)]

In [5]:
%%sql
SELECT      d.DepartmentName, 
            CASE
                WHEN COUNT(a.AccountID) = 0 THEN 'Không có User nào'
                ELSE COUNT(a.AccountID)
            END AS NUM_ACCOUNT
FROM        Account     AS a
RIGHT JOIN  Department  AS d    ON d.DepartmentID = a.DepartmentID
GROUP BY    d.DepartmentName;

 * mysql://root:***@localhost/testing_system_db
6 rows affected.

[('Engineering', '5'),
 ('Finance', '2'),
 ('Human Resources', '3'),
 ('Marketing', '2'),
 ('Operations', '7'),
 ('Phòng chờ', 'Không có User nào')]